Yr8/8-CS-FruitBots/pages/2_lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>FruitBots</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">FruitBots</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Moving your bot to any square</a>
<ul>
<li><a href="#sec-1-1">Learn It</a></li>
<li><a href="#sec-1-2">Learn It</a></li>
<li><a href="#sec-1-3">Document It</a></li>
<li><a href="#sec-1-4">Save It</a></li>
<li><a href="#sec-1-5">Code It</a></li>
<li><a href="#sec-1-6">Code It</a></li>
<li><a href="#sec-1-7">Run It</a></li>
<li><a href="#sec-1-8">Badge It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/MarcScott/8CS-FruitBots">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Moving your bot to any square</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>It would be helpful if we could move out FruitBot to a specific square on the board.
</li>
<li>Any position on the board can be described by two numbers; an x coordinate and a y coordinate
</li>
<li>The smallest x and y positions are 0, and the largest are WIDTH - 1 and HEIGHT - 1
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Let's imagine our bot is at the coordinates x = 4 and y = 3.
</li>
<li>Now let's imagine we want our bot to move to x = 6 and y = 1.
</li>
<li>Which two directions do we need the bot to move in?
</li>
<li>How about if you needed the bot to go to x = 8 and y = 5?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 document">
<h3 id="sec-1-3">Document It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Write down how you can <b>calculate</b> whether the bot needs to move EAST or WEST and NORTH or SOUTH.
</li>
<li>Show your explanation to your teacher.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 save">
<h3 id="sec-1-4">Save It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Rename your old bot from the previous lesson to <i>Lesson1Bot.js</i>
</li>
<li>Now create a new file called <i>mybot.js</i>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 code">
<h3 id="sec-1-5">Code It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Add this code to mybot.js. This time we're going to specify that we want to use board <i>1</i> to test our scripts.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">function new_game() {
}

function default_board_number(){
    return 1;
}

function make_move(){

}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 code">
<h3 id="sec-1-6">Code It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>We'll start by setting a position for our FruitBot to go to.
</li>
<li>To do this we'll create two new variables. <code>target_x</code> and <code>target_y</code>.
</li>
<li>Because these variables are declared outside of any functions, we call them <i>global variables</i>, meaning any function in our program can use them.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript">var target_x = 6;
var target_y = 1;

function new_game() {
}

function default_board_number(){
    return 1;
}

function make_move(){

}
</pre>
</div>
<ul class="org-ul">
<li>Now we need to edit the <code>make_move()</code> function. Make sure you're editing the correct function when we do this.
</li>
<li>First we'll create variables for the bot's current position - <code>my_x</code> and <code>my_y</code>.
</li>
<li>Because these variables are declared inside the function, they are called <i>local variables</i>. Only the <code>make_move()</code> function can use them.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">function make_move(){
    //store the player's x and y position in variables for clearer code.
    var my_x = get_my_x()
    var my_y = get_my_y()
}
</pre>
</div>

<ul class="org-ul">
<li>Now, if <code>my_x</code> is less than the <code>target_x</code> we need the bot to move EAST.
</li>
<li>If <code>my_x</code> is greater than the <code>target_x</code> we need the bot to move WEST.
</li>
<li>We use <code>&lt;</code> for less than and <code>&gt;</code> for greater than.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">function make_move(){
    //store the player's x and y position in variables for clearer code.
    var my_x = get_my_x()
    var my_y = get_my_y()

    if(my_x &lt; target_x){
	return EAST
    }
    else if(my_x &gt; target_x){
	return WEST
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 run">
<h3 id="sec-1-7">Run It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Run game.html and make sure your FruitBot is moving to the correct x position.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 badge">
<h3 id="sec-1-8">Badge It</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>With two more <code>else if</code> conditions we can make out FruitBot move towards the y target. Have a go adding these and see if your FruitBot works.
</li>
<li>Try changing the <code>target_x</code> and <code>target_y</code> variables to make your FruitBot move to different fruits on the board.
</li>
<li>Add a final <code>else{return PASS}</code> condition to the end of the function, so that the FruitBot does nothing when it reaches it's target x and y.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
